# Обрати внимание на комментарии внутри кода

import math
'''
N - разрешение экрана (отправлять в функцию тьюплом, либо списком)
V - объем изображения
I - количество цветов в палитре изображения
M - величина объема изображения (0 - БИТ, 3 - БАЙТ, 13 - КБАЙТ, 26 - МБАЙТ)
'''
def func(N, V, I, M):
   if V: # Перевод объема изображения в биты, если объем НЕ в битах
      V *= 2**M
   if N: # Нахождение общего кол-ва точек изображения (?)
      N = math.prod(N)
   if N and V and not I: # Если просят найти количество цветов в палитре, также поможет для нахождения кол-во бит на пискель
      I = 2**(V // N)
   if I: # Если есть количество цветов в палитре, определит кол-во бит на пиксель (глубину)
      i = math.ceil(math.log(I) / math.log(2))
   if N and i and not V: # Если просят найти объем изображения
      V = N * i
      V //= 2**M
   if V and i and not N: # Если просят найти разрешение изображения
      N = V // i
   return N, V, i, I 
'''
               Пример задания 
Какой минимальный объём памяти (в Кбайт) нужно зарезервировать, 
чтобы можно было сохранить любое растровое изображение размером 64×64 пикселов при условии, 
что в изображении могут использоваться 256 различных цветов?
Известно: N = (64, 64) / [64, 64] - по условию
        V = None (т.к. нам надо найти объем изображения)
        I = 256 - по условию
        M = 13 - объем просят выразить в КБайтах (смотрим пояснение к аргументу M)
'''
print(func((64, 64), None, 256, 13)) 
'''
Получим (4096, 4, 8, 256): за второй параметр отвечает V = 4, записываем в ответ
'''