# Вариант решений 23-х номеров, с обычным вариантом, с вариантом обязательных и избегаемых путей, в случае обязательных путей, например, из 1 в 20, через 10, разбиваем один путь на два и результаты перемножаем, как в примере ниже
def task23(start, end):
    if start == end:
        return 1
    if start > end: # сюда так же добавлять запрещенные числа (через которые нельзя проходить), например, if s == 19
        return 0
    return task23(start + 1, end) + task23(start * 2, end)
print(task23(1, 10) * task23(10, 20))