# Обрати внимание на комментарии внутри кода
import math

'''
N - длина пароля
V - объем файла
A - алфавит пароля (символы из набора...)
K1 - кодировка пароля (0 - БИТ, 3 - БАЙТ, 13 - КБАЙТ, 26 - МБАЙТ)
K2 - кодировка объема (0 - БИТ (или оставить всё как было), 3 - БАЙТ, 13 - КБАЙТ, 26 - МБАЙТ)
D - дополнительная информация
M - количество пользователей, человек и т.д...
'''

def func(N, A, V, K1, K2, M, D):
   i = math.ceil(math.log(A) / math.log(2)) # Узнаем кодировку одного символа
   V = math.ceil((N * i) / 2**K1) + D # Узнаем объем по формуле V = (N * i) / 2**k и добавляем доп. информацию, если есть
   V *= M
   V //= 2**K2 # Превращаем в ту кодировку, которая нужна, если она совпадает с кодировкой на один пароль, то K2 = 0
   return N, V, i

print(func(15, 13, None, 3, 0, 100, 15))